Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཁོ་བོ་ཅག་གི་འཁོར་ཀུན་ཀྱང་མི་རྣམས་ལ་བྱམས་པའི་སེམས་སྐྱེ་བར་འགྱུར་ཏེ།
en: They made various kinds of offerings to the brahmin Jayoṣmāyatana and Sudhana, the head merchant’s son, and then they said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, we and all our retinues developed a loving mind toward humans.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་ཐམས་ཅད་ཀྱང་བྱམས་པའི་སེམས་དང་ལྡན་པར་གྱུར་ཏོ།
en: All yakṣas, rākṣasas, and kumbhāṇḍas also developed loving minds.

source: །དེ་དག་བྱམས་པའི་སེམས་དང་ལྡན་ཞིང་འཚེ་བ་མེད་པ་ལ་ཞུགས་པ་རྣམས་ཁོ་བོ་ཅག་གི་དྲུང་དུ་འོང་ངོ་།
en: They came before us with loving minds and without violence.

source: །ཁོ་བོ་ཅག་ཀྱང་དེ་ལྟར་བྱམས་པའི་དབང་གི་ཟིལ་གྱིས་ནོན་པས། རང་རང་གི་གནས་དེ་དང་། དེ་དག་ན་དགའ་བ་མེད་དེ།
en: We too were overpowered by the power of love, and each of us ceased to delight in our own residences.

source: དེ་ལྟར་བདག་ཅག་ཀྱང་རང་རང་གི་སྐྱེ་བོའི་འཁོར་དང་བཅས་ཏེ།
en: In that way, we each went with our retinues to the presence of the ārya.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །འཕགས་པ་བདག་ཅག་དེ་ལྟར་འོངས་པ་རྣམས་ལ་འཕགས་པ་འདིའི་སྐུ་ལས་བྱུང་བའི་འོད་ཀྱིས་ལུས་ཐམས་ཅད་སྣང་བར་བྱས་ཤིང་། བདེ་བས་ཁྱབ་པར་མཛད་དེ།
en: When we arrived, a light came from this ārya’s body, illuminated all our bodies, and filled us with bliss.

source: དེ་ལྟར་བདག་ཅག་ལུས་དང་སེམས་བདེ་བར་གྱུར་ནས།
en: In that way, both our bodies and minds became blissful.

source: འཕགས་པ་འདི་ནི་ཅི་ནས་ཀྱང་བདག་ཅག་ལ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་གྲུལ་བུམ་དང་། ལུས་སྲུལ་པོ་མང་པོ་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: Then he taught us the Dharma so that the multitude of yakṣas, rākṣasas, kumbhāṇḍas, and kaṭapūtanas would develop the aspiration to enlightenment.”

source: །དྲི་ཟའི་དབང་པོ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་འཁོད་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ཅག་ཀྱང་རང་རང་གི་གནས་ན་འཁོད་པའི་ཚེ། འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་ལས་འོད་བྱུང་སྟེ། བདག་ཅག་གི་གནས་སྣང་བར་གྱུར་ཏོ།
en: Ten thousand gandharva lords were also in the sky above, and they said, “Noble one, while we were each dwelling in our own abodes, and when this ārya was enduring the ascetic practice of the five heats, from this fire came a light that illuminated our abodes.

source: །དེ་ལྟར་བདག་ཅག་འོད་དེས་ཕོག་སྟེ། བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་གྱུར་པས།
en: When that light struck us we experienced inconceivable bliss.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་སྟེ། བདག་ཅག་དྲུང་དུ་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་བདག་ཅག་ཅི་ནས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: We went to be in the presence of this ārya, and when we arrived in his presence, he taught us the Dharma so that we would progress irreversibly toward the highest, complete enlightenment.”

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྟོང་ཕྲག་བཅུ་དག་ཀྱང་རྒྱ་མཚོའི་ནང་ནས་མངོན་པར་འཐོན་ཏེ། ནམ་མཁའ་ལ་པུས་མོ་གཡས་པའི་ལྷ་ང་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ཞིང་འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཁོ་བོ་ཅག་གི་ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་རྒྱ་མཚོ་དང་རིར་བཅས་པའི་ས་ཆེན་པོའི་དཀྱིལ་འཁོར་རབ་ཏུ་གཡོ་བར་གྱུར་ཏེ།
en: Ten thousand asura lords rose up from the ocean, high into the sky, where they knelt on their right knees, and with hands together in homage they paid homage, saying, “Noble one, when this ārya was enduring the ascetic practice of the five heats, our asura world, a great circle of earth with its oceans and mountains, shook.

source: བདག་ཅག་ཀུན་གྱི་ང་རྒྱལ་དང་རློམ་སེམས་དང་། དྲེགས་པ་ཐམས་ཅད་བརྟུལ་ཤུགས་དང་། དཀའ་ཐུབ་ཀྱི་ཟིལ་གྱིས་ནོན་ཏེ།
en: All our arrogance and pride was overwhelmed by his self-discipline and asceticism.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེར་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་གཡོ་སྒྱུ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། ཆོས་ཟབ་མོའི་བཟོད་པ་ལ་གཟུད་པ་དང་། མི་གཡོ་བའི་ཆོས་ཉིད་ལ་རབ་ཏུ་དགོད་པ་དང་། སྟོབས་བཅུའི་ཡེ་ཤེས་ཡོངས་སུ་གྲུབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: We went to be in the presence of this ārya, and when we arrived in his presence, he taught us the Dharma so that we would abandon all deception, enter the patience of the profound Dharma, be established in the unshakable true nature of phenomena, and attain the knowledge of the ten strengths.”

source: །ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཤུགས་ཆེན་པོ་འཛིན་པ་ལ་སྩོགས་པ་ནམ་མཁའ་ལྡིང་གི་དབང་པོ་སྟོང་ཕྲག་བཅུས་ཀྱང་བྲམ་ཟེའི་བུ་ཤིན་ཏུ་སྡུག་གུའི་གཟུགས་སུ་མངོན་པར་སྤྲུལ་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ། །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་དག་ལས་འོད་ཆེན་པོ་བྱུང་སྟེ། བདག་ཅག་གི་གནས་སྣང་བར་བྱས་ནས།
en: Ten thousand garuḍa lords such as the garuḍa lord Mahāvegadhārin manifested in the form of handsome brahmin youths and said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, a great light came from these great masses of fire and illuminated and shook our abodes.

source: ཡོངས་སུ་གཡོ་བར་བྱེད་དོ། །དེས་བདག་ཅག་ཀྱང་འཇིགས་ཤིང་སྐྲག་སྟེ། སྐྱོ་བའི་ཡིད་དང་ལྡན་པར་གྱུར་ནས་འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་།
en: We were frightened, terrified, and dismayed, and so we went to be in the presence of this ārya.

source: །འཕགས་པ་འདི་ཡང་བདག་ཅག་ལ་ཆོས་སྟོན་ཅིང་། བྱམས་པ་ཆེན་པོ་ལ་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །སྙིང་རྗེ་ཆེན་པོ་ལ་ཡང་དག་པར་དགོད་པ་མཛད་དོ། །འཁོར་བའི་རྒྱ་མཚོར་འཇུག་པ་ལ་ཡང་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །འདོད་པའི་འདམ་དུ་བྱིང་བའི་སེམས་ཅན་མངོན་པར་གདོན་པར་བྱ་བ་ལའང་ཡོངས་སུ་སྦྱོར་བ་མཛད་དོ། །ལྷག་པའི་བསམ་པའི་སྒོ་རྣམ་པར་དག་པར་བྱ་བ་ལའང་རབ་ཏུ་སྦྱོར་བ་མཛད་དོ། །ཤེས་རབ་དང་ཐབས་ཤིན་ཏུ་གསལ་བ་ལའང་ཡང་དག་པར་སྦྱོར་བ་མཛད་དོ། །རྣམ་པ་ཇི་ལྟ་བུར་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་སེམས་ཅན་རྣམས་གདུལ་བར་བྱ་བ་ལའང་རབ་ཏུ་སྦྱོར་བ་མཛད་དོ།
en: This ārya taught us the Dharma so that we would practice great love, so that we were established in great compassion, so that we would apply ourselves to plunging into the ocean of saṃsāra, so that we would apply ourselves to saving beings who are sinking in the swamp of desire, so that we would apply ourselves to the pure gateway of the higher motivation for enlightenment, so that we would apply ourselves to sharp wisdom and methods, and so that we would apply ourselves to guiding beings in whatever way will ripen them.”

source: །མིའམ་ཅིའི་དབང་པོ་སྟོང་ཕྲག་བཅུ་ཡང་སྟེང་གི་བར་སྣང་ལ་འཁོད་དེ་འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: Ten thousand kinnara lords were also in the sky.

source: །རིགས་ཀྱི་བུ་འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། ཁོ་བོ་ཅག་གི་གནས་ན་འཁོད་པའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་ལས་དྲིལ་བུའི་དྲ་བ་རིན་པོ་ཆེའི་སྲད་བུས་ལྡ་ལྡིར་བརྒྱུས་པའི་སིལ་སྙན་དང་། རོལ་མོའི་ཡོ་བྱད་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། ཁྱིམ་གྱི་ལོངས་སྤྱོད་ཐམས་ཅད་ལས་སངས་རྒྱས་ཀྱི་སྒྲ་བྱུང་ངོ་། །ཆོས་ཀྱི་སྒྲ་དང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱི་སྒྲ་དང་། བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པའི་སྨོན་ལམ་གྱི་སྒྲ་བྱུང་ངོ་།
en: They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, the sound of the word Buddha , the word Dharma , the words irreversible bodhisattva Saṅgha , and the words the prayer to reach enlightenment came from the rows of palm trees, the music of the garlands of strings of networks of little bells on our trees, the musical instruments, the precious jewelry, the enjoyed possessions in the homes, and the blowing of the breezes in our domain.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་སོ།
en: There came the words that said that in this and that particular world a bodhisattva named such and such is praying to attain enlightenment;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའི་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་དཀའ་བ་ཡོངས་སུ་གཏོང་བ་བྱེད་དོ།
en: in this and that particular world a bodhisattva named such and such is accomplishing a difficult renunciation;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་སྦྱོང་བ་བྱེད་དོ།
en: in this and that particular world a bodhisattva named such and such is purifying the domain of omniscient wisdom;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་སྙིང་པོ་བྱང་ཆུབ་ཏུ་འགྲོའོ།
en: in this and that particular world a bodhisattva named such and such is going to the bodhimaṇḍa;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་མྱིང་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་དཔུང་དང་བཞོན་པར་བཅས་པའི་བདུད་རབ་ཏུ་ཕམ་པར་བྱས་ཏེ། བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: in this and that particular world a bodhisattva named such and such has defeated Māra , and his army is attaining the highest, complete enlightenment of buddhahood;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་དེ་བཞིན་གཤེགས་པ་མཚན་འདི་དང་འདི་ཞེས་བྱ་བ་ཞིག་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཛད་དོ།
en: in this and that particular world a tathāgata named such and such is turning the wheel of the Dharma;

source: །འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གྲངས་སུ་བྱ་བ་ཆེ་གེ་མོ་ཞིག་ན་ནི་དེ་བཞིན་གཤེགས་པ་མཚན་འདི་དང་ནི་ཆེ་གེ་མོ་ཞིག་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་མ་ལུས་པར་མཛད་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཛད་དོ།
en: in this and that particular world a tathāgata named such and such, having accomplished all the deeds of a buddha without remainder, is passing away into the state of nirvāṇa without any remaining skandhas

source: །ཞེས་བྱ་བའི་སྒྲ་འབྱིན་ཏེ། རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་གི་རྩྭ་དང་ཤིང་དང་། ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་ཐམས་ཅད་རྡུལ་ཤིན་ཏུ་ཕྲ་བའི་ཆར་བླགས་པའི་མུར་ཐུག་པར་ནི་རུང་ཡང་སྲིད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་མཚན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པའི་ཁྱད་པར་གང་ཁོ་བོ་ཅག་གི་གནས་ན་ཡོད་པའི་ཤིང་ཏ་ལའི་ཕྲེང་བ་ལས་རོལ་མོའི་ཡོ་བྱད་དང་། རིན་པོ་ཆེའི་རྒྱན་དང་། ཁྱིམ་གྱི་ལོངས་སྤྱོད་རླུང་གིས་བསྐྱོད་པའི་སྒྲ་འབྱུང་ཞིང་། ང་རོ་འབྱིན་པ་དང་། རྣ་ལམ་དུ་གྲགས་པའི་མཐའ་ནི་ཐུག་པར་མི་རུང་ངོ་།
en: “Noble one, it is possible that there could be an end to the number of atoms from all the plants, wood, branches, leaves, and petals in Jambudvīpa, but there is no end to the number of the names of tathāgatas, of the bodhisattva prayers, and of the different engagements in bodhisattva conduct that come from, resound from, and are heard from the rows of palm trees and so on up to the musical instruments, the precious jewelry, the enjoyed possessions in the homes, and the blowing of the breezes in our domain.

source: །དེ་ལྟར་བདག་ཅག་ཀྱང་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་འཇུག་པའི་སྨོན་ལམ་དང་། སྤྱོད་པ་དང་མཚན་གྱི་ཆུ་ཀླུང་གི་སྒྲས་དགའ་བ་ཆེན་པོའི་ཤུགས་དྲག་པོས་ཉམས་བདེ་བ་སྐྱེས་ཏེ།
en: “In that way, we experienced bliss through the intense joy of hearing the sound of a river of the words Buddha , Dharma , and Saṅgha , the prayers and conduct engaged in by bodhisattvas, and their names. “We each went to be in the presence of the ārya.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེ་ལྟར་བདག་ཅག་ཕྱིན་པར་གྱུར་ནས་ཀྱང་། འཕགས་པ་འདི་ནི་བདག་ཅག་ལ་ཅི་ནས་ཀྱང་། ཁོ་བོ་ཅག་གི་འཁོར་གྱི་སེམས་ཅན་དུ་མ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆོས་སྟོན་པ་མཛད་དོ།
en: When we arrived in his presence, this ārya taught us the Dharma so that we would become irreversible in our progress to the highest, complete enlightenment.”

source: །འདོད་པ་ལ་སྤྱོད་པའི་ལྷའི་བུ་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་ཁ་དོག་ཤིན་ཏུ་མཛེས་པ་དག་ཀྱང་ནམ་མཁའ་ལ་འཁོད་ཅིང་ཡིད་ཀྱིས་སྤྲུལ་པའི་མཆོད་པས་མཆོད་པ་བྱས་ནས་འདི་སྐད་ཅེས་འཛེར་ཏོ། །འཕགས་པ་འདི་དཀའ་ཐུབ་ལྔས་ཡོངས་སུ་གདུང་བ་མཛད་པའི་ཚེ། མེའི་ཕུང་པོ་འདི་དག་ལས་རྣམ་པ་འདི་ལྟ་བུའི་འོད་བྱུང་ཏེ།
en: Countless thousands of desire-realm devas with beautiful bodies were also in the sky, making offerings with mentally emanated offerings. They said, “Noble one, when this ārya was enduring the ascetic practice of the five heats, a light came from these great masses of fire.

source: འོད་དེས་མར་ན་མནར་མེད་པ་ཡན་ཆད་དུ་སེམས་ཅན་དམྱལ་བ་རྣམས་སྣང་བར་བྱས་ནས། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྩེ་ཟིལ་བར་བྱས་ཏེ།
en: That light illuminated beings as far down as the Avīci hell and extinguished the sufferings of all the beings in the hells.

source: འོད་དེ་ཉིད་ཀྱིས་འཕགས་པ་འདི་བདག་ཅག་གི་མྱིག་ལམ་དུ་སྣང་བར་བསྟན་པས་དེའི་ཕྱིར་ཁོ་བོ་ཅག་ཀྱང་འཕགས་པ་འདི་ལ་སེམས་མོས་པར་གྱུར་ནས། འདོད་པ་ལ་སྤྱོད་པའི་ལྷའི་རིས་ཉམས་སུ་བདེ་བར་སྐྱེས་སོ། །དེ་ལྟར་བདག་ཅག་ཀྱང་འཕགས་པ་འདིས་མཛད་པ་ལ་དྲིན་དུ་གཟོ་ཞིང་མཐོང་བས་མི་ངོམས་པས་འདོད་པའི་དགའ་བ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ཏེ།
en: That light brought the image of this ārya to our eyes, and therefore we yearned for this ārya and experienced the bliss of the realm of desire devas. In that way, we were grateful to him, never ceased wanting to see him, and renounced delighting in desires.

source: འཕགས་པ་འདིའི་དྲུང་དུ་འདོང་ངོ་། །དེར་བདག་ཅག་ཕྱིན་ནས་ཀྱང་འཕགས་པ་འདི་ནི་ཅི་ནས་ཀྱང་།
en: We went to be in the presence of this ārya.

source: སེམས་ཅན་ཚད་མྱེད་པ་རྣམས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་པ་མཛད་དོ།
en: This ārya taught us the Dharma so that we would pray for the enlightenment of limitless beings.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཆོས་ཀྱི་ཚུལ་རྣམ་པ་འདི་ལྟ་བུ་ཐོས་ནས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Then Sudhana, the head merchant’s son, on hearing this way of the Dharma, was overjoyed, pleased, happy, and content.

source: བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ལ་ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་བསྐྱེད་དེ།
en: He recognized the brahmin Jayoṣmāyatana to be a true kalyāṇamitra.

source: བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་དེ་ལྟར་བདག་གིས་དགེ་བའི་བཤེས་གཉེན་གྱི་བཀའ་དང་། འགལ་བར་བགྱིས་པའི་ནོངས་པ་ལ་ནོངས་པར་བཤགས་སོ།
en: He bowed his head to the feet of the brahmin Jayoṣmāyatana and said, “Ārya, I confess my transgression of having disobeyed a kalyāṇamitra’s instruction.”

source: །དེ་ནས་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the brahmin Jayoṣmāyatana recited this verse to Sudhana, the head merchant’s son:

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་རྗེས་སུ་བསྟན་དང་འཐུན་བྱེད་ཅིང་།
en: “The bodhisattva who successfully follows the instructions

source: དྲན་པ་ཉེ་བར་གཞག་སྟེ་བླ་མའི་ངག་གཅོག་མི་བྱེད་ན།
en: And who is mindful not to disobey the guru’s words

source: དེ་ཕྱིར་དེ་ཡི་དོན་རྣམས་ཐམས་ཅད་འཐུན་པར་འགྲུབ་པར་འགྱུར།
en: Will successfully accomplish all goals and successfully

source: །མཐུན་པའི་སངས་རྒྱས་ཡེ་ཤེས་བྱང་ཆུབ་དྲུང་དུ་འཚང་ཡང་རྒྱ།
en: Attain the wisdom of buddhahood, enlightened under the Bodhi tree.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་རིའི་གཡང་སའི་ལམ་སྤུ་གྲི་སོ་གཤིབས་པ་ལ་འཛེགས་ཏེ། མེའི་ཕུང་པོ་ཆེན་པོ་དེར་མཆོངས་སོ། །དེ་དེ་ལྟར་མཆོངས་པའི་ཚེ།
en: Then Sudhana, the head merchant’s son, climbed the path of razors up the mountain precipice and jumped down into the great mass of fire.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: When he jumped, he attained the bodhisattva samādhi called completely stable

source: །མྱེ་དེས་རེག་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཞི་བའི་བདེ་བ་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ནས་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he landed in the fire, he attained the bodhisattva samādhi called perceiving the bliss of peace

source: །འཕགས་པ་མྱེའི་ཕུང་པོ་ལ་དེ་ལྟར་རེག་ན་བདེ་བ་དང་། རིའི་ལམ་སྤུ་གྲིས་གཏམས་པ་འདི་ཡང་དེ་ལྟར་རེག་ན་བདེ་བ་དེ་ནི་ངོ་མཚར་ཆེའོ། །དེས་སྨྲས་པ།
en: Sudhana said, “I am astonished, Ārya! The touch of the fire was blissful, and the mountain path of razors was also blissful to the touch.”

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དཀྱིལ་འཁོར་ཡོངས་སུ་མི་ཟད་པ་ཐོབ་པ་སྟེ།
en: The brahmin Jayoṣmāyatana said, “Noble one, I have attained the bodhisattva liberation called the unceasing domain

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དཀྱིལ་འཁོར་ཡོངས་སུ་མི་ཟད་པ་འདི་ཤེས་པར་ཟད་ན།
en: However, noble one, I know only this bodhisattva liberation called the unceasing domain

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་མེའི་ཕུང་པོ་ལྟ་བུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་བྱ་བའི་སྨོན་ལམ་ཅན་རུ་མཚོན་ཕྱིར་མི་ལྡོག་པ་དང་ལྡན་པ། སེམས་ལ་ཐུབ་པ་མེད་ཅིང་སེམས་དམའ་བ་མེད་པ་དང་ལྡན་པ། ཡིད་ཞུམ་པ་མེད་པ་ཅན་རྡོ་རྗེའི་སྙིང་པོ་དང་ལྡན་པའི་མཐུ་བོ་ཆེ་ལྟ་བུ་བརྩམས་པ་ཆེན་པོ་མཐར་ཕྱིན་པར་བྱ་བ་ལ་སྒྱིད་ལུག་པ་མེད་པ་སྦྱོར་བ་ལྷོད་པ་མྱེད་པ། རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྩོན་པ། བརྩོན་འགྲུས་ཕྱིར་མི་ལྡོག་པ་དང་ལྡན་པ། ཕྱིར་མི་ཟློག་པའི་གོ་ཅ་བགོས་པ།
en: How could I know or describe the qualities of the bodhisattvas who are like masses of fire, who pray to eliminate all the kleśas and wrong views of all beings, who have an ensign that is never in retreat, who have invincible minds, who have minds that never despair, who have minds that are never despondent, who are like Nārāyaṇa possessing the vajra essence, who reach the conclusion of their great undertakings, who have no despondency, who never slacken, who are like whirlwinds, who are dedicated to the benefit of all beings, who have irreversible diligence, and who wear the armor of irreversibility?

source: དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a city called Siṃha­vijṛmbhita.

source: དེ་ན་རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་བུ་མོ་བྱམས་མ་ཞེས་བྱ་བ་བུ་མོ་ལྔ་བརྒྱའི་འཁོར་དང་བཅས་པ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: There dwells Maitrayaṇī, the daughter of King Siṃhaketu, with her entourage of five hundred maidens. Go to her and ask her, ‘How does a bodhisattva train in bodhisattva conduct? How does a bodhisattva practice it?’

source: བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཀྱི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཞུགས་པ་མོས་པ་རྒྱ་ཆེན་པོས་རྣམ་པར་དག་པ་ཐེག་པ་ཆེན་པོ་ལ་མངོན་དུ་ཕྱོགས་པ། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མངོན་པར་མོས་པ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་ཡང་དག་པར་ཞུགས་པ། དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བར་སྤྲོ་བ། ཆོས་ཀྱི་རིམ་གྲོ་ལ་རྣམ་པར་སྤྱོད་པ། ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་མངོན་དུ་གྱུར་པ། ཡང་དག་པའི་མཐའ་ཤིན་ཏུ་རྟོགས་པ། ཡེ་ཤེས་ཀྱི་མཐའ་ལ་གནས་པའི་ཡུལ་དང་ལྡན་པ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Jayoṣmāyatana, circumambulated the brahmin Jayoṣmāyatana, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the presence of the brahmin Jayoṣmāyatana.

source: དུས་གསུམ་སྐད་ཅིག་གི་ཆ་ཤས་ལ་ཁོང་དུ་ཆུད་པར་བྱེད་པ། ནམ་མཁའི་མཐའ་གཉིས་སུ་མེད་པ་མངོན་དུ་གྱུར་པ། མི་གཉིས་པའི་མཐའ་རྣམ་པར་གདོན་མི་ཟ་བ་ཐོབ་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཐའ་ལ་རྣམ་པར་མི་རྟོག་པར་གནས་པ།
en: Maitrayaṇī

source: བསྒྲིབས་པ་མེད་པའི་མཐས་གདུལ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཞུགས་པ། ཆོས་ཀྱི་མཐའ་དང་མྱི་འགལ་བར་བྱ་བ་ལ་གཞོལ་བ། དེ་བཞིན་གཤེགས་པའི་མཐའ་ལ་མཐའ་མེད་པར་ཁོང་དུ་ཆུད་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཐའ་ལ་རྣམ་པར་མི་རྟོག་པར་གནས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་དྲ་བ་རྣམ་པར་གཏོར་བའི་ཡེ་ཤེས་ལ་གཞོལ་བ།
en: Sudhana, the head merchant’s son, with inconceivable respect for kalyāṇamitras, with a pure, vast aspiration, intent on the Mahāyāna, aspiring to the wisdom of buddhahood, following the Buddhadharma, longing to follow the kalyāṇamitras, practicing veneration of the Dharma, intent on unimpeded wisdom, with conviction in the highest goal, being within the range of the apogee of wisdom, comprehending the three times in a fraction of an instant, intent on the nondual apogee of space, having attained certainty in the apogee of nonduality, dwelling in the nonconceptual apogee of the realm of the Dharma, having entered the comprehension of the way that is the apogee of being free of obscurations, dedicated to the harmony that is the apogee of action, realizing that the apogee of the tathāgatas is without an apogee, dwelling in the nonconceptuality that is the apogee of the buddhas, and dedicated to the wisdom that disperses the network of conceptualizations of all beings, had a mind free from all attachment to realms, free from attachment to all the circles of followers of the buddhas, and practiced, without dwelling in any location, the purification of all buddha realms;

source: ཞིང་ལ་མངོན་པར་ཆགས་པ་ཐམས་ཅད་དང་བྲལ་བ། སངས་རྒྱས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་གནས་པ་མེད་པར་སྤྱོད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པའི་འདུ་ཤེས་དང་ལྡན་པ། སྒྲ་ཐམས་ཅད་ཚིག་གི་ལམ་ལྟ་བུར་ཁོང་དུ་ཆུད་པ།
en: he had the recognition that there is no self and no beings within all beings, comprehended that all sounds are like echoes, and was dedicated to the realization that all forms are the same as reflections of forms.

source: གཟུགས་ཐམས་ཅད་གཟུགས་ཀྱི་གཟུགས་བརྙན་དང་མཉམ་པར་རྣམ་པར་རིག་པར་བྱ་བ་ལ་གཞོལ་བ་དེ་མཐར་གྱིས་སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་གྲོང་ཁྱེར་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana eventually arrived at the city of Siṃha­vijṛmbhita.

source: བུ་མོ་བྱམས་མ་ཚོལ་ཞིང་ཡོངས་སུ་རྨེད་རྨེད་པ་ལས། རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་བུ་མོ་བྱམས་མ་འཁོར་བུ་མོ་ལྔ་བརྒྱ་དང་ལྡན་པ་དེ་ཁང་པ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བའི་ནང་ན་ཁྲི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་རྐང་པ་ཅན།
en: He searched for and sought the maiden Maitrayaṇī and heard that Maitrayaṇī, the daughter of King Siṃhaketu, with her entourage of five hundred maidens, was in a palace called Vairocana­garbha

source: གསེར་གྱི་ལྕག་ཕོད་ཀྱི་དྲ་བས་ལེགས་པར་བླས་པ། ལྷ་རྫས་ཀྱི་སྟན་བཏིང་བ་ལ་འདུག་ཅིང་ཆོས་སྟོན་ཏོ། །ཞེས་ཐོས་ནས།
en: She was teaching the Dharma while seated on a throne that had uragasāra sandalwood legs, was draped in a network of threads of gold, and had a cushion made of divine material.

source: སེང་གེ་རྣམ་པར་བསྒྱིངས་པའི་གྲོང་ཁྱེར་དུ་སོང་སྟེ། རྒྱལ་པོ་སེང་གེ་དཔལ་གྱི་གནས་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Sudhana entered the city of Siṃha­vijṛmbhita and went to the residence of King Siṃhaketu.

source: རྒྱལ་པོའི་ཕྱི་སྒོའི་སྒོ་གང་ན་བུ་མོ་བྱམས་མ་མཐོང་བར་དགའ་བའི་ཕྱིར་སྡོད་ཅིང་འདུག་འདུག་པ་དང་། དེས་དེར་སྲོག་ཆགས་བརྒྱ་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་དུ་མ་འདོང་བ་མཐོང་ནས།
en: He sat at the king’s outer gate hoping to see the maiden Maitrayaṇī. Sudhana saw many hundreds of people, many thousands of people, many hundreds of thousands of people there.

source: ཁྱེད་གང་ནས་འོངས།
en: He asked them, “Where have you come from?

source: ད་གང་དུ་འདོད་ཞེས་དྲིས་པ་དང་། དེ་དག་ན་རེ་ངེད་ནི་བུ་མོ་བྱམས་མའི་དྲུང་དུ་ཆོས་མཉན་པའི་ཕྱིར་འདོང་ངོ་ཞེས་ནས།
en: Where are you going?” They replied, “We have come to hear the Dharma from the maiden Maitrayaṇī.”

source: དེས་བསམས་པ་འདིར་ནི་སུ་འགྲོ་ཡང་བགག་པ་མེད་པ་ལྟ་ཞིག་སྙམ་སྟེ།
en: Sudhana thought, “It seems as if everyone is allowed to go in,” and he went inside.

source: དེ་ཡང་ནང་དུ་ཕྱིན་ཏོ། །དེ་ལྟར་ཕྱིན་ཏེ་བལྟས་ན་ཁང་པ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ཅན་དེ་ཡང་། གཞི་ཤེལ་དུ་འདུག་པའི་ས་ལས་བླངས་ཏེ། བཻ་ཌཱུརྱའི་ཀ་བ་བཀྱེ་བ། རྩིག་པ་རྡོ་རྗེ་ལས་བྱས་པ།
en: When he had gone inside and looked around, he saw that the Vairocana­garbha palace had the inconceivable display of a floor that was made of crystal, pillars made of beryl, and walls made of diamonds;

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྷུན་དང་ལྡན་པའི་བ་གམ་བརྒྱ་ཕྲག་སྟོང་གིས་བརྒྱན་པ། ནོར་བུ་རིན་པོ་ཆེ་གྲངས་མེད་པས་རྣམ་པར་བྲིས་པ། རིན་པོ་ཆེ་སྟོང་གི་སྙིང་པོའི་མེ་ལོང་གི་དཀྱིལ་འཁོར་གྱིས་ཤིན་ཏུ་སྤ་བར་བྱས་པ།
en: it was adorned with hundreds of thousands of pinnacles made of solid gold, was furnished with round mirrors made of the essence of a thousand precious materials, and was adorned with countless precious jewels;
